Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType enum defines the spacing type of a numeric input value for a spacing dimension.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.Distance
The value defines only one spacing.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.DivideTimes
The value defines the number of spacings.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.DivideDistance
The value defines the spacing.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.ExactTimesAndDistance
The value defines the number of spacings and the spacing.